Feature: Вхід користувача
  Я хочу зареєструватися

  Scenario: Успішний вхід в аккаунт
    When Користувач знаходиться на сторінці входу
    Then Користувач вводить свої дані: "testaccaunt@gmail.com" та "whynot234"
    Then Користувач натискає кнопку "Ввійти"
    Then Користувач повинен бачити головну сторінку



  Scenario: Неуспішний вхід в аккаунт
    When Користувач знаходиться на сторінці входу
    Then Користувач вводить свої дані: "t.com" та "whynot234"
    Then Користувач натискає кнопку "Ввійти"
    Then Користувач повинен бачити повідомлення про невдалий вхід